#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-datadog-go_repo_1638C459: Preparing import... [id=cdktn-provider-datadog-go]
github_repository.cdktn-provider-datadog_repo_5981A3A2: Preparing import... [id=cdktn-provider-datadog]
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 5s [id=15746607]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-datadog_repo_secret-alert-prs-slack-webhook-url_81931217 will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-alert-prs-slack-webhook-url_81931217" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-app-id-alias-PROJEN_APP_ID_134A1370 will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-app-id-alias-PROJEN_APP_ID_134A1370" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-app-id_81D8C3B7 will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-app-id_81D8C3B7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B2B87BE2 will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B2B87BE2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-app-private-key_32146EB6 will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-app-private-key_32146EB6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_843EBC76 will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_843EBC76" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_D2FADACA will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_D2FADACA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-gh-token_37789FAE will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-gh-token_37789FAE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-npm-token_3F71B28A will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-npm-token_3F71B28A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-twine-password_70452E7A will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-twine-password_70452E7A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-datadog_repo_secret-twine-username_C1D80EB7 will be created
  + resource "github_actions_secret" "cdktn-provider-datadog_repo_secret-twine-username_C1D80EB7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-datadog"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-datadog_repository-setup_main-protection_41C4310A will be created
  + resource "github_branch_protection" "cdktn-provider-datadog_repository-setup_main-protection_41C4310A" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-datadog"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-datadog-go_repository-setup_auto-approve-label_F9A9DD48 will be created
  + resource "github_issue_label" "cdktn-provider-datadog-go_repository-setup_auto-approve-label_F9A9DD48" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-datadog-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-datadog-go_repository-setup_automerge-label_CD9604DB will be created
  + resource "github_issue_label" "cdktn-provider-datadog-go_repository-setup_automerge-label_CD9604DB" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-datadog-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-datadog-go_repository-setup_no-auto-close-label_8903CF09 will be created
  + resource "github_issue_label" "cdktn-provider-datadog-go_repository-setup_no-auto-close-label_8903CF09" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-datadog-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-datadog_repository-setup_auto-approve-label_10CC22C9 will be created
  + resource "github_issue_label" "cdktn-provider-datadog_repository-setup_auto-approve-label_10CC22C9" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-datadog"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-datadog_repository-setup_automerge-label_E905C774 will be created
  + resource "github_issue_label" "cdktn-provider-datadog_repository-setup_automerge-label_E905C774" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-datadog"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-datadog_repository-setup_no-auto-close-label_91FD061F will be created
  + resource "github_issue_label" "cdktn-provider-datadog_repository-setup_no-auto-close-label_91FD061F" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-datadog"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-datadog-go_repo_1638C459 will be updated in-place
  # (imported from "cdktn-provider-datadog-go")
  ~ resource "github_repository" "cdktn-provider-datadog-go_repo_1638C459" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "CDK Terrain Go provider bindings for datadog."
        etag                        = "W/\"363b66f7abfcef2ec76f696bdd2700da3c24e3dd348a84eceea2d4642003c852\""
        full_name                   = "cdktn-io/cdktn-provider-datadog-go"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-datadog-go.git"
        has_discussions             = false
      - has_downloads               = true -> null
      ~ has_issues                  = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-datadog-go"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-datadog-go.git"
        id                          = "cdktn-provider-datadog-go"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-datadog-go"
        node_id                     = "R_kgDORULJrA"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 1162004908
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-datadog-go.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-datadog-go"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "datadog",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
      ~ vulnerability_alerts        = true -> false
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.cdktn-provider-datadog_repo_5981A3A2 will be updated in-place
  # (imported from "cdktn-provider-datadog")
  ~ resource "github_repository" "cdktn-provider-datadog_repo_5981A3A2" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for datadog."
        etag                        = "W/\"618dd953d22e120825ced94d1a17dc48eeceb88be66ec3b113c3de3c2113eda9\""
        full_name                   = "cdktn-io/cdktn-provider-datadog"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-datadog.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-datadog"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-datadog.git"
        id                          = "cdktn-provider-datadog"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-datadog"
        node_id                     = "R_kgDORULIaA"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 1162004584
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-datadog.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-datadog"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "datadog",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_dependabot_security_updates.cdktn-provider-datadog_dependabot-security_BD336039 will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-datadog_dependabot-security_BD336039" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-datadog"
    }

  # github_repository_webhook.cdktn-provider-datadog-go_repository-setup_slack-webhook_C0EB56AF will be created
  + resource "github_repository_webhook" "cdktn-provider-datadog-go_repository-setup_slack-webhook_C0EB56AF" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-datadog-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-datadog_repository-setup_slack-webhook_E83E7B08 will be created
  + resource "github_repository_webhook" "cdktn-provider-datadog_repository-setup_slack-webhook_E83E7B08" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-datadog"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-datadog-go_repository-setup_managing-team_581FBA5C will be created
  + resource "github_team_repository" "cdktn-provider-datadog-go_repository-setup_managing-team_581FBA5C" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-datadog-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-datadog_repository-setup_managing-team_5ED6FBE1 will be created
  + resource "github_team_repository" "cdktn-provider-datadog_repository-setup_managing-team_5ED6FBE1" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-datadog"
      + team_id    = "15746607"
    }

Plan: 2 to import, 23 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos   = [
        # (6 unchanged elements hidden)
        "github_repository.cdktn-provider-cloudinit_repo_8DDE9C9A.ssh_clone_url",
      + "github_repository.cdktn-provider-datadog_repo_5981A3A2.ssh_clone_url",
        "github_repository.cdktn-provider-docker_repo_B5F1E60F.ssh_clone_url",
        # (14 unchanged elements hidden)
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*